#include <bits/stdc++.h>
using namespace std;

int main()
{
    string str;
    int sum = 0, res = 0, n = 0, len, s = 0, rol = 0;
    // sum记录美轮分数，res记录总分，rol记录轮数，s记录第一次全击中后后续计分次数，n辅助移动字符串，len记录字符串总长
    getline(cin, str); //getline(cin，str)读入一整行存入字符串str
    len = str.length();
    for (int i = 0; i < len; i++)
    {
        if (rol == 10)
        {
            break; //若已进行10论计分，则退出
        }

        sum = 0;
        if (str[i] == '/') //第一次全部击倒的情况
        {
            rol++;        //轮次+1
            s = 0;        //初始化后续计分次数
            sum += 10;    //当前轮次得分+10
            n = 2;        //下一个非空格字符为str[i + n]
            while (s < 2) //后续计分小于2次则进行循环
            {
                if (str[i + n] != ' ') //判断当前是否未空格
                {
                    if (str[i + n] == '/' && str[i + n - 1] == ' ') //下一次完全击倒
                    {
                        sum += 10; //当前轮次得分+10
                        n++;       //后移一位
                        s++;       //后续计分次数+1
                    }

                    if (str[i + n] == '/' && (str[i + n - 1] <= '9' && str[i + n - 1] >= '0')) //下一次未完全击倒，但两次完全击倒
                    {
                        sum += 10 - (str[i + n - 1] - '0'); //第二次完全击倒，与前一次共计该轮得分+10
                        n++;                                //后移一位
                        s++;                                //后续计分次数+1
                    }

                    if (str[i + n] <= '9' && str[i + n] >= '0') //下一次未完全击倒
                    {
                        sum += str[i + n] - '0'; //当前轮次加相应得分
                        n++;                     //后移一位
                        s++;                     //后续计分次数+1
                    }
                }

                else
                {
                    n++; //遇到空格后移一位
                }
            }
        }

        if (str[i] <= '9' && str[i] >= '0') //第一次未完全击倒情况
        {
            rol++;                 //轮次+1
            sum += str[i] - '0';   //当前轮次得分+相应分数
            if (str[i + 1] == '/') //下一次完全击倒
            {
                sum += 10 - (str[i] - '0'); //两次合计得分+10
                if (str[i + 3] == '/')      //下一论一次全部击倒情况
                {
                    sum += 10; //当前轮次得分+10
                }

                if (str[i + 3] <= '9' && str[i + 3] >= '0') //下一轮第一次未完全击倒
                {
                    sum += str[i + 3] - '0'; //当前轮次得分+相应分数
                }

                i++; //后移一位
            }

            if (str[i + 1] <= '9' && str[i + 1] >= '0') //第二次也未能全部击倒情况
            {
                sum += str[i + 1] - '0'; //当前轮次得分+相应分数
                i++;                     //后移一位
            }
        }

        res += sum; //一轮计分完毕计入总分
    }

    cout << res;
    return 0;
}
